п»ї// TV_1.cpp : Р­С‚РѕС‚ С„Р°Р№Р» СЃРѕРґРµСЂР¶РёС‚ С„СѓРЅРєС†РёСЋ "main". Р—РґРµСЃСЊ РЅР°С‡РёРЅР°РµС‚СЃСЏ Рё Р·Р°РєР°РЅС‡РёРІР°РµС‚СЃСЏ РІС‹РїРѕР»РЅРµРЅРёРµ РїСЂРѕРіСЂР°РјРјС‹.
//

using namespace std;

/* Р”РѕРїРёС€РёС‚Рµ РєР»Р°СЃСЃ РІ СЃРѕРѕС‚РІРµС‚СЃС‚РІРёРё СЃ С‚СЂРµР±РѕРІР°РЅРёСЏРјРё Р·Р°РґР°РЅРёСЏ*/
class TV {
public:

    // Р’РєР»СЋС‡Р°РµС‚ С‚РµР»РµРІРёР·РѕСЂ.
    void TurnOn() {
        // РќР°РїРёС€РёС‚Рµ РєРѕРґ СЌС‚РѕРіРѕ РјРµС‚РѕРґР°
        is_turned_on_ = true;
        return;
    }

    // Р’С‹РєР»СЋС‡Р°РµС‚ С‚РµР»РµРІРёР·РѕСЂ
    void TurnOff() {
        // РќР°РїРёС€РёС‚Рµ РєРѕРґ СЌС‚РѕРіРѕ РјРµС‚РѕРґР°
        is_turned_on_ = false;
        return;
    }

    // Р’РѕР·РІСЂР°С‰Р°РµС‚ true, РµСЃР»Рё С‚РµР»РµРІРёР·РѕСЂ РІРєР»СЋС‡РµРЅ Рё false, РµСЃР»Рё С‚РµР»РµРІРёР·РѕСЂ РІС‹РєР»СЋС‡РµРЅ
    bool IsTurnedOn() {
        // РќР°РїРёС€РёС‚Рµ РєРѕРґ СЌС‚РѕРіРѕ РјРµС‚РѕРґР°
        if (is_turned_on_ == true) { return true; }
        else return false;
    }

    // Р’РѕР·РІСЂР°С‰Р°РµС‚ РЅРѕРјРµСЂ С‚РµРєСѓС‰РµРіРѕ РєР°РЅР°Р»Р°, Р»РёР±Рѕ 0, РµСЃР»Рё С‚РµР»РµРІРёР·РѕСЂ Р±С‹Р» РІС‹РєР»СЋС‡РµРЅ.
    // РўРµР»РµРІРёР·РѕСЂ РїСЂРё РІС‹РєР»СЋС‡РµРЅРёРё В«Р·Р°РїРѕРјРёРЅР°РµС‚В» РЅРѕРјРµСЂ С‚РµРєСѓС‰РµРіРѕ РєР°РЅР°Р»Р°,
    // Р° РїСЂРё РІРєР»СЋС‡РµРЅРёРё вЂ” В«РІРѕСЃСЃС‚Р°РЅР°РІР»РёРІР°РµС‚В» РµРіРѕ.
    // РџСЂРё РїРµСЂРІРѕРј РІРєР»СЋС‡РµРЅРёРё С‚РµР»РµРІРёР·РѕСЂ РїРѕРєР°Р·С‹РІР°РµС‚ РєР°РЅР°Р» в„–1.
    int GetCurrentChannel() {
        // РќР°РїРёС€РёС‚Рµ РєРѕРґ СЌС‚РѕРіРѕ РјРµС‚РѕРґР°

        if (is_turned_on_ == true) {
            return current_channel_;
        }
        return 0;
    }

    // Р’С‹Р±РёСЂР°РµС‚ РєР°РЅР°Р» СЃ СѓРєР°Р·Р°РЅРЅС‹Рј РЅРѕРјРµСЂРѕРј. РќРѕРјРµСЂ РєР°РЅР°Р»Р° РґРѕР»Р¶РµРЅ Р±С‹С‚СЊ РІ РґРёР°РїР°Р·РѕРЅРµ [1..99].
    // Р•СЃР»Рё СѓРєР°Р·Р°РЅ РЅРµРґРѕРїСѓСЃС‚РёРјС‹Р№ РЅРѕРјРµСЂ РєР°РЅР°Р»Р°, Р»РёР±Рѕ С‚РµР»РµРІРёР·РѕСЂ РІС‹РєР»СЋС‡РµРЅ, РІРѕР·РІСЂР°С‰Р°РµС‚ false Рё РЅРµ РјРµРЅСЏРµС‚
    // С‚РµРєСѓС‰РёР№ РєР°РЅР°Р». Р’ РїСЂРѕС‚РёРІРЅРѕРј СЃР»СѓС‡Р°Рµ РІРѕР·РІСЂР°С‰Р°РµС‚ true.
    bool SelectChannel(int channel) {
        // РќР°РїРёС€РёС‚Рµ РєРѕРґ СЌС‚РѕРіРѕ РјРµС‚РѕРґР°    
        if (is_turned_on_ == true && channel >= 1 && channel <= 99) {
            current_channel_ = channel;
            return true;
        }
        return false;
    }


private:
    bool is_turned_on_ = false;
    int current_channel_ = 1;

};

int main() {
    TV tv;
    cout << tv.IsTurnedOn() << ", channel:"s << tv.GetCurrentChannel() << endl;
    tv.TurnOn();
    cout << tv.IsTurnedOn() << ", channel: "s << tv.GetCurrentChannel() << endl;
    tv.SelectChannel(25);
    cout << tv.IsTurnedOn() << ", channel: "s << tv.GetCurrentChannel() << endl;
    tv.TurnOff();
    cout << tv.IsTurnedOn() << ", channel: "s << tv.GetCurrentChannel() << endl;
}